# hostTrussId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TrussMemberInfo..::..hostTrussId Property
TrussMemberInfo Class See Also
---
The host truss' ElementId of the member.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementId hostTrussId { get; set; }
```

Visual Basic
---
```text
Public Property hostTrussId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ hostTrussId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# See Also
TrussMemberInfo Class
Autodesk.Revit.DB.Structure Namespace